# Lecture 16 – Applying

## Data 6, Summer 2024

In [1]:
from datascience import *
import numpy as np

## Motivation

Until now, we've primarily worked with just the data we've been given in our tables. However, oftentimes some of our data needs to be manipulated or "cleaned" before we can work with it to infer things about the world.

For example, we have been given this table of dogs and their ages in 'human years'. While this may be useful in some contexts, what if we want to know each dog's age in 'dog years'. For this example, we will use the (incorrect) conversion of one human year being equivalent to 7 dogs years — you can read about a more accurate conversion [here](https://pets.webmd.com/dogs/how-to-calculate-your-dogs-age).

In [ ]:
pups = Table.read_table('data/pups.csv')

In [ ]:
pups

We already know how to convert the column `age` to dog years using **array arithmetic**. We can then add this new array as a new column in our table.

In [ ]:
pups.with_columns(
    'dog years', pups.column('age') * 7
)

## Apply

Now that we know how to write our own functions, we can leverage these functions to manipulate our tables in particular ways. This is really useful if we want to extract or convert data in our table to generate new insights about it.

We can use `tbl.apply(col, func)` to **apply** the function `func` to the column `col`. This creates an array when each item is the result of evaluating `func` with the corresponding item in `col` as the input. This essentially allows you to do multiple function calls all at the same time.

In [ ]:
def seven_times(x):
    return 7 * x

In [ ]:
pups.apply(seven_times, 'age')

Note, we wouldn't actually use the above example with `.apply` since we could just write `pups.column('age') * 7`.

Here's a more useful example:

In [ ]:
def email_from_name(name):
    first, last = name.split(' ')
    email = first + '.' + last + '@dogschool.edu'
    return email.lower()

In [ ]:
# Can use email_from_name on a single argument
email_from_name('Champ Major')

In [ ]:
pups.apply(email_from_name, 'name')

In [ ]:
pups.with_columns('email', pups.apply(email_from_name, 'name'))

Notice how fast and easy that was!

### Quick Check 1

In [2]:
# Large file – this may take ~10 seconds to load
salary = Table.read_table('https://media.githubusercontent.com/media/dailycal-projects/ucb-faculty-salary/master/data/salary/salary_2015.csv')
salary

year | location | first      | last       | title                 | gross   | regular | overtime | other
2015 | Berkeley |  ANNE      | AABOE      | BUS SYS ANL 4         | 124,454 | 124,454 | 0        | 0
2015 | Berkeley |  DAVID     | AAKER      | RECALL FACULTY        | 2,500   | 0       | 0        | 2,500
2015 | Berkeley |  ELIZABETH | ABEL       | PROF-AY               | 138,775 | 138,775 | 0        | 0
2015 | Berkeley |  NORMAN    | ABRAHAMSON | ADJ PROF-AY-1/9-B/E/E | 19,668  | 19,668  | 0        | 0
2015 | Berkeley |  BARBARA   | ABRAMS     | PROF-AY               | 191,162 | 169,862 | 0        | 21,300
2015 | Berkeley |  JOHN      | ACZON      | FINANCIAL SVC ANL 3   | 83,510  | 78,510  | 0        | 5,000
2015 | Berkeley |  ANTHONY   | ADAMS      | RES-FY                | 9,587   | 9,587   | 0        | 0
2015 | Berkeley |  PENNY     | HINES      | ACAD HR ANL 5         | 126,707 | 126,707 | 0        | 0
2015 | Berkeley |  ANINDITA  | ADHIKARI   | SR LECT SOE-AY        | 107,345 | 107,345 | 0        | 0
2015 | Berkeley |  ILAN      | ADLER      | PROF-AY-B/E/E         | 166,617 | 151,617 | 0        | 15,000
... (281504 rows omitted)

In [3]:
profs = salary.select('first', 'last', 'title', 'gross').where('title', are.containing('PROF'))
profs

first      | last       | title                 | gross
 ELIZABETH | ABEL       | PROF-AY               | 138,775
 NORMAN    | ABRAHAMSON | ADJ PROF-AY-1/9-B/E/E | 19,668
 BARBARA   | ABRAMS     | PROF-AY               | 191,162
 ILAN      | ADLER      | PROF-AY-B/E/E         | 166,617
 VINOD     | AGGARWAL   | PROF-AY               | 167,525
 ALICE     | AGOGINO    | PROF-AY-B/E/E         | 243,259
 DAVID     | ALDOUS     | PROF-AY               | 218,666
 RONELLE   | ALEXANDER  | PROF-AY               | 167,642
 NEZAR     | ALSAYYAD   | PROF-AY               | 210,389
 GENEVIEVE | AMES       | ADJ PROF-AY           | 9,783
... (17564 rows omitted)

Look at the very last row of the output – that gross income doesn't look right.

In [ ]:
profs.sort('gross', descending = True)

The issue here is that the elements in the `gross` column of the table `profs` right now are strings (instead of integers, which is what we would expect). Fill in the blanks to replace the elements in the `gross` column with integers. _(Hint: use the fix_income function)_

In [5]:
def fix_income(income):
    return str(income.replace(',', ''))

In [6]:
fixed_income = profs.apply(fix_income, 'gross') # Fill in the blanks to fix the `gross` column

profs = profs.with_columns(
    'gross', fixed_income
)

fixed_income_int = profs.apply(int, 'gross')
profs = profs.with_columns(
    'gross', fixed_income_int
)

In [ ]:
profsprofs.sort('gross', descending = True)

## Masking

Python also allows us to select elements of an array or rows in a table based off of **boolean masking** (also called boolean indexing).

In [ ]:
numbers = np.array([15, 14, -2, 1, 9])

The syntax for boolean masking is not what we're used to, so don't worry too much about understanding it.

In [ ]:
numbers[[True, False, True, False, False]]

Notice how masking the `numbers` array with an array of booleans allowed us to get only the elements of `numbers` that we wanted.

Let's see another example:

In [ ]:
gradebook = Table().with_columns(
    'Name', np.array(['Carrera', 'Panamera', 'Taycan', 'Cayenne', 'Macan', 'Cayman', 'Boxster']),
    'Grading Option', np.array(['GRD', 'PNP', 'PNP', 'GRD', 'GRD', 'GRD', 'PNP']),
    'Score', np.array([98, 86, 67.5, 45, 82, 88, 71])
)

In [ ]:
gradebook

`gradebook` is a table of fake students, their scores/grades, and their grading option (letter graded - "GRD" or Pass/No Pass - "PNP"). Let's use boolean masking to get only the students whose grading option is "GRD".

In [ ]:
gradebook.where(make_array(True, False, False, True, True, True, False))

This weird `.where` call is actually what's happening under the hood when we do `gradebook.where("Grading Option", "GRD")`

In [ ]:
gradebook.where("Grading Option", "GRD")

In [ ]:
# You'll learn what this line means next lecture
letter_grade = gradebook.column("Grading Option") == 'GRD'

In [ ]:
gradebook.where(letter_grade)

That being said, boolean masking is pretty tedious, so we almost exclusively rely on the usual `.where` syntax.

### Example: Countries

Run the following cell – ignore the `lambda` parts:

In [ ]:
countries = Table.read_table('data/countries.csv')
countries = countries.relabeled('Country(or dependent territory)', 'Country') \
           .relabeled('% of world', '%') \
           .relabeled('Source(official or UN)', 'Source')
countries = countries.with_columns(
    'Country', countries.apply(lambda s: s[:s.index('[')].lower() if '[' in s else s.lower(), 'Country'),
    'Population', countries.apply(lambda i: int(i.replace(',', '')), 'Population'),
    '%', countries.apply(lambda f: float(f.replace('%', '')), '%')
)

In [ ]:
countries

Let's find all of the countries whose name starts or ends with the letter 'a':

In [ ]:
def starts_or_ends_with_a(name):
    return name[0] == 'a' or name[-1] == 'a'

In [ ]:
countries.apply(starts_or_ends_with_a, 'Country')

In [ ]:
countries.where(countries.apply(starts_or_ends_with_a, 'Country'))